package task4_streams;

/**
 * Задача 1.У вас есть список целых чисел. Напишите код с использованием стримов для поиска максимального
 * и минимального элементов в этом списке.
 *
 *
 * Задача 2.У вас есть список строк. Напишите код с использованием стримов для фильтрации уникальных
 * строк (удаление дубликатов) из этого списка.
 */
public class PracticalStreams {
































    /**
     * Задача 1.
     *
     *List<Integer> numbers = Arrays.asList(10, 5, 8, 20, 3, 15);
     *
     * int max = numbers.stream()
     *     .max(Integer::compareTo)
     *     .orElse(0);
     *
     * int min = numbers.stream()
     *     .min(Integer::compareTo)
     *     .orElse(0);
     *
     * System.out.println("Максимальное значение: " + max);
     * System.out.println("Минимальное значение: " + min);
     *
     * Задача 2.
     *
     * List<String> words = Arrays.asList("Apple", "Banana", "Cherry", "Apple", "Date", "Banana");
     *
     * List<String> uniqueWords = words.stream()
     *     .distinct()
     *     .collect(Collectors.toList());
     *
     * System.out.println(uniqueWords);
     *
     */
}
